package org.example.week2.abstraction9;

public class Lect9 {
    public static void main(String[] args) {

        ///  학습 키워드
        // 추상화 - 특정 계층에서 필요한 본질적인 특성만 유지하고 불필요한 세부사항을 숨기는 객체지향의 특징

        ///  추상화란
        //- 고양이 → 동물 → 생명체
        //- `추상화`란 불필요한 정보를 제거하고 본질적인 특징만 남기는 것을 의미합니다.
        //- 객체지향 프로그래밍에서는 추상화의 계층적 특징을 활용해서 유지보수성이 좋은 프로그램을 만들 수 있습니다.
        //- 이런 추상화 특징을 활용할 수 있다는 것이 객체지향의 3번째 특징입니다.
        //- 우리는 계층구조를 자바의 특징(인터페이스 상속, 클래스 상속) 구현할 수 있습니다.
        //- 추상화의 특징은 다형성에서 활용됩니다.


    }
}
